of-run/canal/canal2D/04-owc1800w130-FFt-z10-flowRate/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes//Esquema de discretización para la 1ªderivada temporal
{
    default         Euler;//transitorio, 1er orden implicito, estable
}

gradSchemes//subdiccionario que contiene los términos gradientes
{
    default         Gauss linear;/*discretización estandar de volúmenes finitos de la integración Gaussiana la cual requiere la interpolación de los valores centrados en las celdas a los centrados en las caras.*/
}

divSchemes //términos divergentes
{
    div(rhoPhi,U)  Gauss linearUpwind grad(U);////second order, upwind-biased, unbounded
    div(phi,alpha)  Gauss vanLeer;//limited scheme, with less strong limiting than limitedLinear
    div(phirb,alpha) Gauss linear;
    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;//second order, unbounded
}

laplacianSchemes//the diffusion term in the momentum equations
{
    default         Gauss linear corrected;//Gauss scheme for discretisation. psi=1 correspond to corrected
}

interpolationSchemes
{
    default         linear;//from cell centres to face centres
}

snGradSchemes//Gradiente normal a la superficie
{
    default         corrected;
}


// ************************************************************************* //
